# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /home/kunal/workshop/icc2_workshop_collaterals/nangate_typical.lib
read_liberty -lib -ignore_miss_dir -setattr blackbox /home/kunal/workshop/icc2_workshop_collaterals/sram/sram_32_1024_freepdk45.lib

read_verilog /home/kunal/workshop/icc2_workshop_collaterals/raven_wrapper.v
read_verilog /home/kunal/workshop/icc2_workshop_collaterals/raven_soc.v
read_verilog /home/kunal/workshop/icc2_workshop_collaterals/raven_spi.v
read_verilog /home/kunal/workshop/icc2_workshop_collaterals/spi_slave.v

# High-level synthesis
#Added by Kunal#
#hierarchy -generate tsmc65lp_* o:Q o:QA o:QB \
#                               i:CLK i:CLKA i:CLKB \
#                               i:CEN i:CENA i:CENB \
#                               i:GWEN \
#                               i:A i:AA i:AB \
#                               i:D i:DB \
#                               i:WEN i:WENA i:WENB\
#                               i:STOV \
#                               i:EMA i:EMAA i:EMAB \
#                               i:EMAW i:EMAS i:RET1N \
#                               i:SE i:TEN o:CENY o:WENY o:AY \
#                               o:SO i:SI i:TCEN i:TWEN i:TA i:TD \
#                               i:DFTRAMBYP i:PGEN i:KEN i:BEN i:TQ
synth -top raven_wrapper
techmap -map /home/kunal/workshop/icc2_workshop_collaterals/cells_latch.v
simplemap
#extract -map /usr/local/share/qflow/tech/nangate45nm/forClkGate.v
# Map register flops
dfflibmap -liberty /home/kunal/workshop/icc2_workshop_collaterals/nangate_typical.lib
opt

# Map combinatorial cells, standard script
abc -exe /usr/local/share/qflow/bin/yosys-abc -liberty /usr/local/share/qflow/tech/nangate45nm/nangate45nm.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten
setundef -zero

clean -purge
# Output buffering
iopadmap -outpad BUF_X1 A:Z -bits
# Cleanup
opt
clean
rename -enumerate
write_blif  -buf BUF_X1 A Z raven_wrapper.synth.blif
stat
write_verilog -noattr raven_wrapper.synth.v

